Repository: yeager/po-diff
Catalog: locale/*/LC_MESSAGES/po-diff.po
Languages: ru

source: positional arguments
ru: позиционные аргументы

source: options
ru: параметры

source: po-diff - Compare PO/TS translation files
ru: po-diff - Сравнение файлов перевода PO/TS

source: Old/original file
ru: Старый/исходный файл

source: New/updated file
ru: Новый/обновлённый файл

source: Output format (default: text)
ru: Формат вывода (по умолчанию: text)

source: Save report to file
ru: Сохранить отчёт в файл

source: Show this help message and exit
ru: Показать справку и выйти

source: Show version number and exit
ru: Показать версию и выйти

source: Examples: po-diff old.po new.po # Compare two files po-diff -f html -o diff.html old.po new.po # Generate HTML report po-diff -f json old.po new.po # JSON output
ru: Примеры: po-diff старый.po новый.po # Сравнить два файла po-diff -f html -o diff.html старый.po новый.po # Создать HTML-отчёт po-diff -f json старый.po новый.po # Вывод в JSON

source: 📈 Summary
ru: 📈 Сводка

source: Old entries: {count}
ru: Старых записей: {count}

source: New entries: {count}
ru: Новых записей: {count}

source: Added: {count}
ru: Добавлено: {count}

source: Removed: {count}
ru: Удалено: {count}

source: Modified: {count}
ru: Изменено: {count}

source: ✅ No changes found
ru: ✅ Изменений не найдено

source: Added
ru: Добавлено

source: Removed
ru: Удалено

source: Modified
ru: Изменено

source: Fuzzy resolved
ru: Fuzzy разрешено

source: Marked fuzzy
ru: Помечено fuzzy

source: ... and {count} more
ru: ... и ещё {count}

source: ❌ Error: File not found: {file}
ru: ❌ Ошибка: Файл не найден: {file}

source: 📄 Report saved to: {file}
ru: 📄 Отчёт сохранён в: {file}
