Repository: yeager/po-diff
Catalog: po/man/*.po
Languages: sv

source: February 2026
sv: Februari 2026

source: User Commands
sv: Användarkommandon

source: NAME
sv: NAMN

source: po-diff - compare two PO files and show translation changes
sv: po-diff - jämför två PO-filer och visa översättningsändringar

source: B<po-diff> [I<OPTIONS>] I<OLD_FILE> I<NEW_FILE>
sv: B<po-diff> [I<FLAGGOR>] I<GAMMAL_FIL> I<NY_FIL>

source: DESCRIPTION
sv: BESKRIVNING

source: B<po-diff> compares two PO (gettext) translation files and reports the differences. It shows added, removed, and modified translations, making it easy to review changes between file versions.
sv: B<po-diff> jämför två PO-översättningsfiler (gettext) och rapporterar skillnaderna. Det visar tillagda, borttagna och modifierade översättningar, vilket gör det enkelt att granska ändringar mellan filversioner.

source: Unlike generic diff tools, po-diff understands PO file structure and compares entries by their msgid, providing meaningful translation-aware diffs instead of raw line differences.
sv: Till skillnad från generiska diff-verktyg förstår po-diff PO-filens struktur och jämför poster efter deras msgid, vilket ger meningsfulla översättningsmedvetna diffar istället för råa radskillnader.

source: Exit codes: 0 = no differences, 1 = differences found, 2 = usage error.
sv: Avslutningskoder: 0 = inga skillnader, 1 = skillnader hittade, 2 = användningsfel.

source: POSITIONAL ARGUMENTS
sv: POSITIONELLA ARGUMENT

source: I<OLD_FILE>
sv: I<GAMMAL_FIL>

source: Path to the old/original PO file (the baseline for comparison).
sv: Sökväg till den gamla/ursprungliga PO-filen (baslinjen för jämförelse).

source: I<NEW_FILE>
sv: I<NY_FIL>

source: Path to the new/updated PO file (the version to compare against).
sv: Sökväg till den nya/uppdaterade PO-filen (den version som ska jämföras).

source: OPTIONS
sv: FLAGGOR

source: Output format. Choices:
sv: Utdataformat. Alternativ:

source: B<text> (default)
sv: B<text> (standard)

source: Human-readable colored text output showing added, removed, and modified entries with context.
sv: Läsbar färgad text som visar tillagda, borttagna och modifierade poster med sammanhang.

source: Structured JSON output with arrays for added, removed, and modified entries. Each entry includes msgid, old msgstr, and new msgstr.
sv: Strukturerad JSON-utdata med matriser för tillagda, borttagna och modifierade poster. Varje post innehåller msgid, gammal msgstr och ny msgstr.

source: Standalone HTML report with syntax-highlighted diffs, suitable for sharing or archiving.
sv: Fristående HTML-rapport med syntaxmarkerade skillnader, lämplig för delning eller arkivering.

source: B<-o>, B<--output> I<FILE>
sv: B<-o>, B<--output> I<FIL>

source: Save the diff report to a file instead of printing to stdout.
sv: Spara diff-rapporten i en fil istället för att skriva ut den till stdout.

source: Show help message and exit.
sv: Visa hjälpinformation och avsluta.

source: Show version number and exit.
sv: Visa versionsnummer och avsluta.

source: EXIT STATUS
sv: AVSLUTSSTATUS

source: Files are identical (no translation differences).
sv: Filerna är identiska (inga översättningsskillnader).

source: Differences found.
sv: Skillnader upptäckta.

source: Usage error (file not found, invalid format).
sv: Användningsfel (fil hittades inte, ogiltigt format).

source: EXAMPLES
sv: EXEMPEL

source: Compare two versions of a Swedish translation:
sv: Jämför två versioner av en svensk översättning:

source: Generate a JSON diff:
sv: Generera en JSON-diff:

source: po-diff --format json old.po new.po
sv: po-diff --format json gammal.po ny.po

source: Save an HTML report:
sv: Spara en HTML-rapport:

source: SEE ALSO
sv: SE ÄVEN

source: AUTHOR
sv: UPPHOVSPERSON

source: BUGS
sv: BUGGAR

source: Report bugs at: https://github.com/yeager/po-diff/issues
sv: Rapportera buggar på: https://github.com/yeager/po-diff/issues

source: COPYRIGHT
sv: UPPHOVSRÄTT

source: Copyright \(co 2026 Daniel Nylander. License: GPL-3.0-or-later.
sv: Copyright \(co 2026 Daniel Nylander. Licens: GPL-3.0-eller-senare.
