Repository: yeager/po-diff
Catalog: po/*.po
Languages: sv

source: 📈 Summary
sv: 📈 Sammandrag

source: Old entries: {count}
sv: Gamla poster: {count}

source: New entries: {count}
sv: Nya poster: {count}

source: Added: {count}
sv: Tillagda: {count}

source: Removed: {count}
sv: Borttagna: {count}

source: Modified: {count}
sv: Ändrade: {count}

source: ✅ No changes found
sv: ✅ Inga ändringar hittades

source: Added
sv: Lade till

source: Removed
sv: Tog bort

source: Modified
sv: Ändrade

source: Fuzzy resolved
sv: Luddig löst

source: Marked fuzzy
sv: Markerade luddig

source: ... and {count} more
sv: ... och {count} till

source: positional arguments
sv: positionsargument

source: options
sv: flaggor

source: po-diff - Compare PO/TS translation files
sv: po-diff - Jämrför PO/TS-översättningsfiler

source: Examples: po-diff old.po new.po # Compare two files po-diff -f html -o diff.html old.po new.po # Generate HTML report po-diff -f json old.po new.po # JSON output
sv: Exampel: po-diff old.po new.po # Jämför två filer po-diff -f html -o diff.html old.po new.po # Generera HTML-rapport po-diff -f json old.po new.po # JSON-utdata

source: Old/original file
sv: Gammal/ursprunglig fil

source: New/updated file
sv: Ny/uppdaterad fil

source: Output format (default: text)
sv: Utdataformat (standard: text)

source: Save report to file
sv: Spara rapport till fil

source: Show this help message and exit
sv: Visa detta hjälpmeddelande och avsluta

source: Show version number and exit
sv: Visa versionsnummer och avsluta

source: ❌ Error: File not found: {file}
sv: ❌ Fel: Filen hittades inte: {file}

source: 📄 Report saved to: {file}
sv: 📄 Rapport sparades till: {file}
